Тестовая_база_ERP_14/src/Documents/CRM_Интерес/CRM_Интерес.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_Интерес</name>
  <comment>Интерес</comment>
  <basedOn>Document.CRM_Интерес</basedOn>
  <basedOn>Catalog.Партнеры</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки в процентах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ основание</comment>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.CRM_РассылкаЭлектронныхПисем</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Телемаркетинг</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.CRM_Заявка</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef.УдалитьCRM_Сделка</types>
      <types>DocumentRef.КоммерческоеПредложениеКлиенту</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <comment>Контактное лицо</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяВыручка</name>
    <comment>Ожидаемая выручка</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <comment>Офис подразделения</comment>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <comment>Клиент</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СделкаСКлиентом</name>
    <comment>Только для объединенных решений</comment>
    <type>
      <types>CatalogRef.СделкиСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <comment>Только для объединенных решений</comment>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение ответственного</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотенциальныйКлиент</name>
    <comment>Потенциальный клиент</comment>
    <type>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказа</name>
    <comment>Причина отказа</comment>
    <type>
      <types>CatalogRef.CRM_ПричиныОтказаПоИнтересам</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Тема</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <comment>Тип услуги</comment>
    <type>
      <types>CatalogRef.CRM_ТипУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкиРассчитаны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсталосьОтгрузить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отгружено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНабора</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНабора</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкидкиНаценки</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаценка</name>
      <type>
        <types>CatalogRef.СкидкиНаценки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НапомнитьПозже</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/CommonModules/CRM_Модуль_РаботаСФормамиКлиент/Module.bsl
Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры) Экспорт
	Если Команда.Имя = "СкрытьПоказатьИнтересы"	Тогда
		КомандаСкрытьПоказатьИнтересы(Форма);
	КонецЕсли;	
	
	Если Команда.Имя = "CRM_ИнтересСтрокой"	Тогда
		Если ПустаяСтрока(Форма.CRM_ИнтересСтрокой) И Форма.CRM_ТаблицаИнтересов.Количество() > 0 Тогда
			// нажата кнопка очистить
			ОчиститьТекущийИнтерес(Форма);
		Иначе
			// нажата кнопка выбора
			ИнтересНачалоВыбора(Форма);
		КонецЕсли;	
	КонецЕсли;
	
	Если Команда.Имя = "Основной"	Тогда
		ТекущиеДанные = Форма.Элементы.CRM_ТаблицаИнтересов.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если ТекущиеДанные.Партнер <> Форма.Объект.Партнер Тогда
			Возврат;
		КонецЕсли;			
		Форма.CRM_ИнтересСтрокой	= CRM_ОбщегоНазначенияСервер.СформироватьПредставлениеИнтересаСтрокой(ТекущиеДанные.Ссылка);
		МассивСтрок = Форма.CRM_ТаблицаИнтересов.НайтиСтроки(новый Структура("Ссылка",ТекущиеДанные.Ссылка));
		Форма.CRM_ТаблицаИнтересов.Сдвинуть(Форма.CRM_ТаблицаИнтересов.Индекс(МассивСтрок[0]),-Форма.CRM_ТаблицаИнтересов.Индекс(МассивСтрок[0]));
		
		//УдалитьИнтересыПрочихПартнеров(Форма);
	КонецЕсли;	
	
	Если Команда.Имя = "ДобавитьИнтерес"	Тогда
		ИнтересНачалоВыбора(Форма, Ложь);
	КонецЕсли;
	
	Если Команда.Имя = "ОткрытьИнтерес"	Тогда
		Если Форма.CRM_ТаблицаИнтересов.Количество() > 0 Тогда
			ПоказатьЗначение(,Форма.CRM_ТаблицаИнтересов[0].Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Если Команда.Имя = "УдалитьИнтерес"	Тогда
		ТекущиеДанные = Форма.Элементы.CRM_ТаблицаИнтересов.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		МассивСтрок = Форма.CRM_ТаблицаИнтересов.НайтиСтроки(новый Структура("Ссылка",ТекущиеДанные.Ссылка));
		Форма.CRM_ТаблицаИнтересов.Удалить(Форма.CRM_ТаблицаИнтересов.Индекс(МассивСтрок[0]));
		Если Форма.CRM_ТаблицаИнтересов.Количество() > 0 Тогда
			Форма.CRM_ИнтересСтрокой	=  CRM_ОбщегоНазначенияСервер.СформироватьПредставлениеИнтересаСтрокой(Форма.CRM_ТаблицаИнтересов[0].Ссылка);
		Иначе	
			Форма.CRM_ИнтересСтрокой	= "";
		КонецЕсли;	
		//УдалитьИнтересыПрочихПартнеров(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура КомандаСкрытьПоказатьИнтересы(Форма)
	
	Форма.Элементы.СкрытьПоказатьИнтересы.Пометка = НЕ Форма.Элементы.СкрытьПоказатьИнтересы.Пометка;
	Форма.Элементы.ГруппаCRM_ТаблицаИнтересов.Видимость = Форма.Элементы.СкрытьПоказатьИнтересы.Пометка;
	
	//УдалитьИнтересыПрочихПартнеров(Форма);	
КонецПроцедуры

Процедура ИнтересНачалоВыбора(Форма, УстановитьОсновным = Истина)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ПометкаУдаления", Ложь);
	СтруктураОтбора.Вставить("Партнер", Форма.Объект.Партнер);
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора"			, Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор"	, Ложь);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе"	, Истина);
	ПараметрыФормыВыбора.Вставить("ЭтоВыборИнтереса"	, Истина);	
	
	ПараметрыФормыВыбора.Вставить("Отбор"				, СтруктураОтбора);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИнтересОкончаниеВыбора", ЭтотОбъект, Новый Структура("Форма,УстановитьОсновным", Форма, УстановитьОсновным));
	
	ОткрытьФорму("Документ.CRM_Интерес.Форма.ФормаСписка", ПараметрыФормыВыбора, , Новый УникальныйИдентификатор, ВариантОткрытияОкна.ОтдельноеОкно,, ОписаниеОповещения);
	
КонецПроцедуры


Процедура ИнтересОкончаниеВыбора(ВыбранноеЗначение, ДопПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Форма = ДопПараметры.Форма;	
	Если ДопПараметры.УстановитьОсновным Тогда
		Форма.CRM_ИнтересСтрокой	= CRM_ОбщегоНазначенияСервер.СформироватьПредставлениеИнтересаСтрокой(ВыбранноеЗначение);
	КонецЕсли;	
	
	МассивСтрок = Форма.CRM_ТаблицаИнтересов.НайтиСтроки(новый Структура("Ссылка",ВыбранноеЗначение));
	
	Если МассивСтрок.Количество() = 0 Тогда
		НоваяСтрока = Форма.CRM_ТаблицаИнтересов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, CRM_Модуль_РаботаСФормамиСервер.ПолучитьСтруктуруСтрокиИнтересов(ВыбранноеЗначение));
		Если ДопПараметры.УстановитьОсновным Тогда
			Форма.CRM_ТаблицаИнтересов.Сдвинуть(Форма.CRM_ТаблицаИнтересов.Индекс(НоваяСтрока),-Форма.CRM_ТаблицаИнтересов.Индекс(НоваяСтрока));
		КонецЕсли;	
	ИначеЕсли ДопПараметры.УстановитьОсновным Тогда	
		Форма.CRM_ТаблицаИнтересов.Сдвинуть(Форма.CRM_ТаблицаИнтересов.Индекс(МассивСтрок[0]),-Форма.CRM_ТаблицаИнтересов.Индекс(МассивСтрок[0]));
	КонецЕсли;
	
	//УдалитьИнтересыПрочихПартнеров(Форма);
КонецПроцедуры

Процедура ОчиститьТекущийИнтерес(Форма, УстановитьОсновным = Истина)
	
	Форма.CRM_ТаблицаИнтересов.Удалить(0);
	
	Если Форма.CRM_ТаблицаИнтересов.Количество() > 0 Тогда
		
		ТекущаяСтрока = Форма.CRM_ТаблицаИнтересов[0];
		
		Если ТекущаяСтрока.Партнер = Форма.Объект.Партнер Тогда
			Форма.CRM_ИнтересСтрокой	= CRM_ОбщегоНазначенияСервер.СформироватьПредставлениеИнтересаСтрокой(ТекущаяСтрока.Ссылка);			
		КонецЕсли;
		
	КонецЕсли;
	
	//УдалитьИнтересыПрочихПартнеров(Форма);
	
КонецПроцедуры

Процедура УдалитьИнтересыПрочихПартнеров(Форма)
	
	ИндексТекущейСтроки = 0;
	
	Пока ИндексТекущейСтроки < Форма.CRM_ТаблицаИнтересов.Количество() Цикл 
		
		ТекущаяСтрока = Форма.CRM_ТаблицаИнтересов[ИндексТекущейСтроки];
		
		Если ТекущаяСтрока.Партнер = Форма.Объект.Партнер Тогда
			ИндексТекущейСтроки = ИндексТекущейСтроки + 1;
		Иначе	
			Форма.CRM_ТаблицаИнтересов.Удалить(ТекущаяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры// УдалитьИнтересыПрочихПартнеров(Форма)
